\chapter{Matrices}

Matrix operations such as addition and multiplication
are mechanical, and are therefore perfectly suited for 
a computer.



%========================================
\section{Defining}
Define a matrix with \Sage's \inlinecode{matrix} function.
It of course takes the entries of the matrix, written as lists of rows.
It also takes the number field.
As we did with vector spaces we can use \inlinecode{RDF} for 
floating point number entries, 
or we can use \inlinecode{CDF} to get complex number entries $a+bi$ where 
$a$ and~$b$ are floating points,
or we can fall back to the rational numbers.
\begin{sagecommandline}
sage: A = matrix(RDF, [[1, 2], [3, 4]])
sage: A
sage: i = CDF(i)
sage: A = matrix(CDF, [[1+2*i, 3+4*i], [5+6*i, 7+8*i]])
sage: A
sage: A = matrix(QQ, [[1, 2], [3, 4]])
sage: A                           
\end{sagecommandline}
\noindent
For the complex numbers,
by default \Sage{} uses $i$ for the square root of $-1$, in contrast with 
\python{} which uses~$j$.
But the letter~$i$ is used for many things\Dash perhaps earlier in 
a session we used it for the index of an array\Dash so before using it
for the complex numbers
resetting it with \inlinecode{CDF(i)} is a good practice.

In this chapter, unless we have reason to do otherwise
we'll use rational numbers because the matrices are easier to 
read\Dash $1$ is easier than $1.0$\Dash and 
because the matrices in the book usually have rational entries.

The \inlinecode{matrix} constructor allows you to specify the number of
rows and columns.
\begin{sagecommandline}
sage: B = matrix(QQ, 2, 3, [[1, 1, 1], [2, 2, 2]])  
sage: B
\end{sagecommandline}
\noindent
If your specified size doesn't match the entries you list 
\begin{lstlisting}[style=python]
sage: B = matrix(QQ, 3, 3, [[1, 1, 1], [2, 2, 2]])  
\end{lstlisting}
\noindent
then \Sage's error says
\inlinecode{Number of rows does not match up with specified number}.
Until now we've let \Sage{} figure out the matrix's 
number of rows and columns size from the entries but
a shortcut to get the zero matrix 
is to put the number zero in the place of the entries, and there you
must say which size you want.
\begin{sagecommandline}
sage: B = matrix(QQ, 2, 3, 0)                     
sage: B
\end{sagecommandline}
\noindent
Another place where specifying the size is a convenience is 
\Sage's shortcut to get an identity matrix.
\begin{sagecommandline}
sage: B = matrix(QQ, 2, 2, 1)
sage: B
\end{sagecommandline}
\noindent
The difference between this shortcut and the prior one is that 
\inlinecode{matrix(QQ, 3, 2, 1)} gives an error because 
an identity matrix must be square.
\Sage{} has another shortcut that can't lead to this error.
\begin{sagecommandline}
sage: I = identity_matrix(4)
sage: I
\end{sagecommandline}

\Sage{} has a wealth of methods on matrices.
For instance, you can transpose the rows to columns or test if the 
matrix is \textit{symmetric},
unchanged by transposition.
\begin{sagecommandline}
sage: A = matrix(QQ, [[1, 2], [3, 4]])
sage: A.transpose()
sage: A.is_symmetric()
\end{sagecommandline}




%========================================
\section{Linear combinations}
Addition and subtraction are natural.
\begin{sagecommandline}
sage: A = matrix(QQ, [[1, 2], [3, 4]])
sage: B = matrix(QQ, [[1, 1], [2, -2]])
sage: A+B
sage: A-B
sage: B-A
\end{sagecommandline}

\Sage{} knows that adding matrices with different sizes is undefined; 
this gives an error. 
% \begin{sagecommandline}
% sage: A = matrix(QQ, [[1, 2], [3, 4]])
% sage: C = matrix(QQ, [[0, 0, 2], [3, 2, 1]])
% sage: A+C
% \end{sagecommandline}
\noindent
Some of the lines in that output block don't contain useful information so 
they've just been truncated.
But the last line, which is so long it had to be broken and wrapped 
twice, is where the action is.
It says that the \inlinecode{+} operand is not defined between a
$\nbyn{2}$~matrix and a $\nbym{2}{3}$~matrix.

Scalar multiplication is also natural,
so you have linear combinations.
\begin{sagecommandline}[d,0,2]
sage: A = matrix(QQ, [[1, 2], [3, 4]])
sage: B = matrix(QQ, [[1, 1], [2, -2]])
sage: 3*A
sage: 3*A-4*B
\end{sagecommandline}



%========================================
\section{Multiplication}

\subsection{Matrix-vector product}
Matrix-vector multiplication is just what you would guess.
\begin{sagecommandline}
sage: A = matrix(QQ, [[1, 3, 5, 9], [0, 2, 4, 6]])
sage: v = vector(QQ, [1, 2, 3, 4])
sage: A*v
\end{sagecommandline}
\noindent
The $\nbym{2}{4}$~matrix $A$ multiplies the 
$\nbym{4}{1}$~column vector~$\vec{v}$, with the vector on the right side,
as $A\vec{v}$.

If you try this vector on the left as 
\inlinecode{v*A} then \Sage{} gives a mismatched-sizes error.
% \begin{sagecommandline}
% sage: A = matrix(QQ, [[1, 3, 5, 9], [0, 2, 4, 6]])
% sage: v = vector(QQ, [1, 2, 3, 4])
% sage: v*A
% \end{sagecommandline}
\noindent
As in the earlier error message, 
some lines are truncated but the final line is wrapped 
twice to show it all.
It says, in short, that the product of a size~$4$ vector with
a size~$\nbym{2}{4}$ matrix is not defined.

Of course you can multiply from the left by a vector if it has a size that 
matches the matrix.
\begin{sagecommandline}[d,0,1]
sage: A = matrix(QQ, [[1, 3, 5, 9], [0, 2, 4, 6]])
sage: w = vector(QQ, [3, 5])
sage: w*A
\end{sagecommandline}
\noindent
In practice you will sometimes 
see matrix-vector multiplications done with vectors
on the left, and sometimes on the right.
The textbook has the vector on the right, 
to have the product
$H\vec{x}$ fit visually with the map application $h(x)$.
\Sage{} will do either, although it has something of a preference
for the vector on the left (as we will see in Chapter~\ref{chapter:maps}).



\subsection{Matrix-matrix product}
If the sizes match then \Sage{} will multiply the matrices.
Here is the product of a $\nbyn{2}$~matrix $A$ and a $\nbym{2}{3}$~matrix $B$.
\begin{sagecommandline}
sage: A = matrix(QQ, [[2, 1], [4, 3]])
sage: B = matrix(QQ, [[5, 6, 7], [8, 9, 10]]) 
sage: A*B
\end{sagecommandline}
Trying $\inlinecode{B*A}$ gives an error 
\inlinecode{TypeError: unsupported operand parent(s) for '*'}, reflecting that
the product operation in this order is undefined.
% \begin{sagecommandline}
% sage: A = matrix(QQ, [[2, 1], [4, 3]])
% sage: B = matrix(QQ, [[5, 6, 7], [8, 9, 10]]) 
% sage: B*A
% \end{sagecommandline}

Same-sized square matrices have the product defined in either order.
\begin{sagecommandline}
sage: A = matrix(QQ, [[1, 2], [3, 4]])
sage: B = matrix(QQ, [[4, 5], [6, 7]])
sage: A*B
sage: B*A
\end{sagecommandline}
\noindent
They are different; matrix multiplication is not commutative.
\begin{sagecommandline}[d,0,2]
sage: A = matrix(QQ, [[1, 2], [3, 4]])
sage: B = matrix(QQ, [[4, 5], [6, 7]])
sage: A*B == B*A
\end{sagecommandline}

In fact, matrix multiplication is very non-commutative 
in that if you produce two $\nbyn{n}$~matrices
at random then they almost surely don't commute.
\Sage{} lets us produce matrices at random.
\begin{sagecommandline}
sage: random_matrix(RDF, 3, min=-1, max=1)
sage: random_matrix(RDF, 3, min=-1, max=1)
\end{sagecommandline}
\noindent  
(Note the \inlinecode{RDF}.
We prefer real number entries here because
\Sage's \inlinecode{random_matrix} 
is more straightforward in this case than in the  
rational entry case.)
% \begin{sagecommandline}
% sage: number_commuting = 0 
% sage: for n in range(1000):  # 1000 just as a large number of tries
% sage:     A = random_matrix(RR, 2, min=-1, max=1)
% sage:     B = random_matrix(RR, 2, min=-1, max=1)
% sage:     if (A*B == B*A): 
% sage:         number_commuting = number_commuting + 1

% print "number commuting of 1000=",number_commuting
% \end{sagecommandline}
\begin{lstlisting}
sage: number_commuting = 0 
sage: for n in range(1000):                                       
....:     A = random_matrix(RDF, 2, min=-1, max=1)
....:     B = random_matrix(RDF, 2, min=-1, max=1)
....:     if (A*B == B*A):
....:         number_commuting = number_commuting + 1 
....: 
sage: print "number commuting of 1000=",number_commuting
number commuting of 1000= 0  
\end{lstlisting}

% Plug a square matrix into a polynomial.
 


\subsection{Inverse}
Recall that if $A$ is nonsingular then its \textit{inverse} $A^{-1}$
is the matrix such that $AA^{-1}=A^{-1}A$ is the identity matrix. 
\begin{sagecommandline}
sage: A = matrix(QQ, [[1, 3, 1], [2, 1, 0], [4, -1, 0]])
sage: A.is_singular()
\end{sagecommandline}
\noindent
For $\nbyn{2}$ matrix inverses we have a formula.
In the book to do by-hand inverses for larger cases 
we write the original matrix next to the identity 
and then do Gauss-Jordan reduction.
\begin{sagecommandline}
sage: A = matrix(QQ, [[1, 3, 1], [2, 1, 0], [4, -1, 0]])
sage: I = identity_matrix(3)
sage: B = A.augment(I, subdivide=True)
sage: B
sage: C = B.rref()
sage: C
\end{sagecommandline}
\noindent
The inverse is the resulting matrix on the right.
\begin{sagecommandline}
sage: A = matrix(QQ, [[1, 3, 1], [2, 1, 0], [4, -1, 0]])
sage: I = identity_matrix(3)
sage: B = A.augment(I, subdivide=True)
sage: C = B.rref()
sage: A_inv = C.matrix_from_columns([3, 4, 5])
sage: A_inv
sage: A*A_inv
sage: A_inv*A
\end{sagecommandline}

This is an operation that \Sage{} users do all the time so there is a
standalone command.
\begin{sagecommandline}[d,0,1]
sage: A = matrix(QQ, [[1, 3, 1], [2, 1, 0], [4, -1, 0]])
sage: A_inv = A.inverse()
sage: A_inv
\end{sagecommandline}

One reason for finding the inverse is to make solving linear systems easier.
These three systems
\begin{equation*}
  \begin{linsys}{3}
    x  &+ &3y &+ &z &= &4 \\
    2x &+ &y  &  &  &= &4 \\
    4x &- &y  &  &  &= &4 
  \end{linsys}
  \qquad\qquad
  \begin{linsys}{3}
    x  &+ &3y &+ &z &= &2 \\
    2x &+ &y  &  &  &= &-1 \\
    4x &- &y  &  &  &= &5 
  \end{linsys}
  \qquad\qquad
  \begin{linsys}{3}
    x  &+ &3y &+ &z &= &1/2 \\
    2x &+ &y  &  &  &= &0 \\
    4x &- &y  &  &  &= &12 
  \end{linsys}
\end{equation*}
share the matrix of coefficients but have different vectors on
the right side.
If you have first calculated the inverse of the matrix of coefficients
then solving each system takes just a matrix-vector product.
\begin{sagecommandline}
sage: A = matrix(QQ, [[1, 3, 1], [2, 1, 0], [4, -1, 0]])
sage: A_inv = A.inverse()
sage: v1 = vector(QQ, [4, 4, 4])
sage: v2 = vector(QQ, [2, -1, 5])
sage: v3 = vector(QQ, [1/2, 0, 12])
sage: A_inv*v1
sage: A_inv*v2
sage: A_inv*v3
\end{sagecommandline}



\section{Running time}
Since computers are fast and accurate
they open up the possibility of solving problems that are quite large.
Large linear algebra problems occur frequently in science and
engineering.
In this section we will suggest what limits there are to how big the 
problems can get, and still be solvable.
(In this section we will use matrices with real entries because they are 
common in applications.)

One of the limits on just how large a problem we can do is how quickly 
the computer can give us the answer.
Naturally computers take longer to perform operations 
on matrices that are larger
but it may be that the time the program takes to compute the answer
grows more quickly than does the size of the problem\Dash for instance, 
it may be that when the size of the problem doubles then the time to 
do the job more than doubles.

The matrix inverse operation is a good illustration.
This is an important operation; for instance, if we could do large matrix 
inverses
quickly then we could quickly solve large linear systems, 
with just a matrix-vector product.
% Timing gives bad output.  It has extra mu's in there.  I don't
% know how to fix it; I suspect it is a bug in sagemath.sty.
% \begin{sagecommandline}
% sage: A = matrix(RDF, [[1, 3, 1], [2, 1, 0], [4, -1, 0]])
% sage: A
% sage: A.is_singular()
% sage: timeit('A.inverse()')
% \end{sagecommandline}
\begin{lstlisting}
sage: A = matrix(RDF, [[1, 3, 1], [2, 1, 0], [4, -1, 0]])
sage: A
[ 1.0  3.0  1.0]
[ 2.0  1.0  0.0]
[ 4.0 -1.0  0.0]
sage: A.is_singular()
False
sage: timeit('A.inverse()')
625 loops, best of 3: 62.7 μs per loop
\end{lstlisting}
\noindent
\Sage's \inlinecode{timeit} makes a best guess about how long
the operation takes.\footnote{%
  It reports the wall time, not the time the CPU
  spent but rather how long it took when timed
  by watching the wall clock.}
It runs the command 
a number of times, because on any one time your
computer may have been slowed down by a 
disk write or some other interruption.

The inverse operation took on the order of hundreds of microseconds.
A single microsecond is 
$0.000\,001$~seconds.
That's fast, but then $A$ is only a $\nbyn{3}$ matrix.

And, $A$ is a particular~$\nbyn{3}$ matrix. 
You'd like to know
how long it takes to invert a generic, or average, matrix.
You could try finding the inverse of a random matrix.
% \begin{sagecommandline}
% sage: timeit('random_matrix(RDF, 3, min=-1, max=1).inverse()')
% sage: timeit('random_matrix(RDF, 3, min=-1, max=1).inverse()')
% sage: timeit('random_matrix(RDF, 3, min=-1, max=1).inverse()')
% \end{sagecommandline}
\begin{lstlisting}
sage: timeit('random_matrix(RDF, 3, min=-1, max=1).inverse()')
625 loops, best of 3: 86 μs per loop
sage: timeit('random_matrix(RDF, 3, min=-1, max=1).inverse()')
625 loops, best of 3: 85.8 μs per loop
sage: timeit('random_matrix(RDF, 3, min=-1, max=1).inverse()')
625 loops, best of 3: 86.6 μs per loop
\end{lstlisting}
\noindent
Again this is of the order of hundreds of microseconds.

But this has the issue that we can't tell from it  
whether the time is spent generating
the random matrix or finding the inverse.
In addition, there is a subtler point: we also can't tell right away if
this command generates many random matrices and finds 
each's inverse,
or if it generates one random matrix and applies the inverse many times.
The next code at least makes that point clear.
For the sizes $\nbyn{3}$, $\nbyn{10}$, etc.,
if finds a single random matrix and then 
gets the time to compute its inverse.
\begin{lstlisting}
sage: for size in [3, 10, 25, 50, 75, 100, 150, 200]:
....:     print "size=",size
....:     M = random_matrix(RR, size, min=-1, max=1)
....:     timeit('M.inverse()')
....: 
size= 3
625 loops, best of 3: 125 µs per loop
size= 10
625 loops, best of 3: 940 µs per loop
size= 25
25 loops, best of 3: 12 ms per loop
size= 50
5 loops, best of 3: 92.4 ms per loop
size= 75
5 loops, best of 3: 308 ms per loop
size= 100
5 loops, best of 3: 727 ms per loop
size= 150
5 loops, best of 3: 2.45 s per loop
size= 200
5 loops, best of 3: 5.78 s per loop
\end{lstlisting}
Some of those times are in microseconds, some are in milliseconds, and some
are in seconds.
This table is consistently in seconds.
\begin{center}
  \begin{tabular}{r|r@{.}l}
    \textit{size}     &\multicolumn{2}{c}{\textit{seconds}}  \\  \hline
    $3$      &$0$ &$000\,125$ \\
    $10$     &$0$ &$000\,940$ \\
    $25$     &$0$ &$012$ \\
    $50$     &$0$ &$092\,4$ \\
    $75$     &$0$ &$308$ \\
    $100$    &$0$ &$727$ \\
    $150$    &$2$ &$45$ \\
    $200$    &$5$ &$78$ 
  \end{tabular}
\end{center}
The time grows faster than the size.
For instance, in going from size~$25$ to size~$50$ the time more than
doubles: $0.0924/0.012$ is $7.7$.
Similarly, increasing the size from $50$ to~$200$ causes the time to 
increase by much more than a factor of four: $5.78/0.0924\approx 62.55$. 

To get a picture give \Sage{} the data as a list of pairs.
\begin{sagecommandline}
sage: d = [(3, 0.000125), (10, 0.000940), (25, 0.012),  
....:      (50, 0.0924), (75, 0.308), (100, 0.727), 
....:      (150, 2.45), (200, 5.78)]
sage: g = scatter_plot(d)  
sage: g.save("graphics/mat001.pdf")            
\end{sagecommandline}
\begin{sagesilent}
d = [(3, 0.000125), (10, 0.000940), (25, 0.012),  
     (50, 0.0924), (75, 0.308), (100, 0.727), 
     (150, 2.45), (200, 5.78)]
g = scatter_plot(d, markersize=10, facecolor='#b9b9ff')
g.save("graphics/mat001.pdf", figsize=[2.25,1.5], axes_pad=0.05, fontsize=7)
\end{sagesilent}
\noindent
(If you enter \inlinecode{scatter_plot(d)} at the prompt, that is, 
without saving it as~$g$, then \Sage{} will pop up a window with the
graphic.)\footnote{The graphics in this manual are generated using 
more drawing options than appear in the output block.
For instance, the scatter plot here came from
\protect\inlinecode{g = scatter_plot(d, markersize=10, facecolor='#b9b9ff')}
and was saved in a file with
\protect\inlinecode{g.save("graphics/mat001.pdf", figsize=[2.25,1.5], axes_pad=0.05, fontsize=7)}.
We shall omit much of this code about decoration as clutter.
See the \protect\Sage{} manual for \protect\inlinecode{plot} options.}
\begin{center}
  \includegraphics{graphics/mat001.pdf}
\end{center}
The graph dramatizes that the ratio $\text{time}/\text{size}$
is not constant
since the data clearly does not lie on a line.

Here is some more data.
The times are big enough that this computer had to run overnight.
\begin{lstlisting}
sage: for size in [500, 750, 1000]:                             
....:         print "size=",size
....:     M = random_matrix(RR, size, min=-1, max=1)
....:     timeit('M.inverse()')
....: 
size= 500
5 loops, best of 3: 89.2 s per loop
size= 750
5 loops, best of 3: 299 s per loop
size= 1000
5 loops, best of 3: 705 s per loop
\end{lstlisting}
Again the table is a neater way to present the data.
\begin{center}
  \begin{tabular}{r|r@{.}l}
    \textit{size}     &\multicolumn{2}{c}{\textit{seconds}}  \\  \hline
    $500$       &$89$ &$2$ \\
    $750$       &$299$ &   \\
    $1000$      &$705$ &   
  \end{tabular}
\end{center}
Get a graph by tacking the new data onto the existing data.
\begin{sagecommandline}
sage: d = [(3, 0.000125), (10, 0.000940), (25, 0.012),  
....:      (50, 0.0924), (75, 0.308), (100, 0.727), 
....:      (150, 2.45), (200, 5.78)]
sage: d = d + [(500, 89.2), (750, 299), (1000, 705)]
sage: g = scatter_plot(d)                           
sage: g.save("graphics/mat002.pdf")                      
\end{sagecommandline}
\begin{sagesilent}
d = [(3, 0.000125), (10, 0.000940), (25, 0.012),  
     (50, 0.0924), (75, 0.308), (100, 0.727), 
     (150, 2.45), (200, 5.78)]
d = d + [(500, 89.2), (750, 299), (1000, 705)]
g = scatter_plot(d, markersize=10, facecolor='#b9b9ff')
g.save("graphics/mat002.pdf", figsize=[2.25,2.25], axes_pad=0.05, fontsize=7)              
\end{sagesilent}
The result is this graphic.
\begin{center}
  \includegraphics{graphics/mat002.pdf}
\end{center}
Note that the two graphs have different scales;
if you generated this graph with the same vertical scale as the prior one
then the data would fall off the top of the page.

So a practical limit to the size of a problem that we can solve with
this matrix inverse operation comes from the fact that the graph above is
not a line.
The time required grows much faster than the size, and just gets too large. 

A major effort in Computer Science is to find fast algorithms to 
do practical tasks.
Many people have worked on tasks in Linear Algebra in particular,
such as finding the inverse of a matrix, because
they are so common in applications.

\endinput


TODO:
